---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LightingFixtureLightEmitter
source: html/3506ebc0-38e1-65e7-ca58-af887c1767b2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LightingFixtureLightEmitter Property

"Light Emitter"

## Syntax (C#)
```csharp
public static ForgeTypeId LightingFixtureLightEmitter { get; }
```